Documents/ПеремещениеЖивотного.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПеремещениеЖивотного</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыМестаСодержанияЖивотных</xr:Item>
				<xr:Item>AccumulationRegister.ЗаполненностьКомнат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомнатаДо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Комнаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомнатаПосле</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Комнаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПеремещенияЖивотных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗаполненностьКомнат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаполненностьКомнат</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоКотов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комната</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Комнаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СтатусыМестаСодержанияЖивотных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыМестаСодержанияЖивотных</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПребыванияЖивотных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоСодержания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Комнаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПеремещенияЖивотных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеСтатусовНазначениюКомнат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеСтатусовНазначениюКомнат</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПребыванияЖивотных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияКомнат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыПребыванияЖивотных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПребыванияЖивотных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаКарантине</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаЛеченииПриют</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаЛеченииВетклиника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКУкотовлению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Укотовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПередержке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мертв</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Комнаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Комнаты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вместимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияКомнат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПеремещениеЖивотного/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЗаполненностьКомнат Приход
	Движения.ЗаполненностьКомнат.Записывать = Истина;
	Движение = Движения.ЗаполненностьКомнат.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Комната = КомнатаПосле;
	Движение.КоличествоКотов = 1;	
	
	Движения.ЗаполненностьКомнат.БлокироватьДляИзменения = Истина;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаполненностьКомнатОстатки.Комната.Представление КАК КомнатаПредставление
		|ИЗ
		|	РегистрНакопления.ЗаполненностьКомнат.Остатки(&ДатаПеремещения, Комната.Ссылка = &Комната) КАК ЗаполненностьКомнатОстатки
		|ГДЕ
		|	ЗаполненностьКомнатОстатки.Комната.Вместимость - ЗаполненностьКомнатОстатки.КоличествоКотовОстаток < 0";
	
	Запрос.УстановитьПараметр("ДатаПеремещения", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Комната", КомнатаПосле);

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			ТекстСообщения = СтрШаблон("Комната %1 заполнена. Перемещение невозможно!", Выборка.КомнатаПредставление);
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// регистр ЗаполненностьКомнат Расход
	Движения.ЗаполненностьКомнат.Записывать = Истина;
	Движение = Движения.ЗаполненностьКомнат.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Комната = КомнатаДо;
	Движение.КоличествоКотов = 1;
	
	НовыйСтатусКота = СтатусКотаПоКомнате(КомнатаПосле);
	
	Если НовыйСтатусКота = Перечисления.СтатусыПребыванияЖивотных.ПустаяСсылка() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// регистр СтатусыМестаСодержанияЖивотных
	Движения.СтатусыМестаСодержанияЖивотных.Записывать = Истина;
	Движение = Движения.СтатусыМестаСодержанияЖивотных.Добавить();
	Движение.Период = Дата;
	Движение.Кошка = Кошка;
	Движение.Статус = НовыйСтатусКота;
	Движение.МестоСодержания = КомнатаПосле;
	Движение.ПричинаПеремещения = ПричинаПеремещения;
	
КонецПроцедуры

Функция СтатусКотаПоКомнате(Комната)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоответствиеСтатусовНазначениюКомнат.Статус КАК Статус,
		|	Комнаты.Представление КАК КомнатаПредставление
		|ИЗ
		|	Справочник.Комнаты КАК Комнаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСтатусовНазначениюКомнат КАК СоответствиеСтатусовНазначениюКомнат
		|		ПО Комнаты.Назначение = СоответствиеСтатусовНазначениюКомнат.Назначение
		|ГДЕ
		|	Комнаты.Ссылка = &Комната";
	
	Запрос.УстановитьПараметр("Комната", Комната);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтатусКота = Перечисления.СтатусыПребыванияЖивотных.ПустаяСсылка();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтатусКота = Выборка.Статус;
	Иначе
		Ошибка = СтрШаблон("Для комнаты %1 не задано соответствие ее назначения статусу подопечного!", Выборка.КомнатаПредставление);
		ОбщегоНазначения.СообщитьПользователю(Ошибка);
	КонецЕсли;
	
	Возврат СтатусКота;
	
КонецФункции
